{
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_qwen2.Qwen2Config",
    "AutoModelForCausalLM": "modeling_qwen2.Qwen2ForCausalLM"
  },
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.02,
  "intermediate_size": 6912,
  "max_position_embeddings": 32768,
  "max_window_layers": 21,
  "model_type": "qwen2",
  "num_attention_heads": 20,
  "num_hidden_layers": 40,
  "num_key_value_heads": 20,
  "rms_norm_eps": 1e-06,
  "rope_theta": 5000000.0,
  "sliding_window": 32768,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.37.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}
